{
  "data": {
    "about": [
      "Born 1992 in Gothenburg, Sweden. Computers have always been in my presence, and it all started with the legendary Amiga.",
      "My passion for video games got me into programming in high school. There, I chose to study programming and game development, and that's when I was introduced to programming languages such as Java and C++.",
      "After high school I ventured on to study for a Bachelor's degree in Computer Science at Blekinge Institute of Technology in Karlskrona, Sweden. Here, I was taught all the fundamentals of software development; software architecture and design, agile software development (SCRUM, etc.), advanced programming, code testing, and more. In the final year, I and six others were to develop a big scale game for a course. I got the role as the lead graphics programmer.",
      "When I completed my studies in Karlskrona, I felt that I needed a broader knowledge of Computer Science. So that's when I moved to Uppsala to start my Master's degree in Computer Science at Uppsala University.",
      "There I discovered many other fields within Computer Science such as Machine Learning, Artificial Intelligence and Parallel Programming. The second year, I had the opportunity to study abroad for one semester which I did not hesitate to take. I chose South Korea, to study Computer Science at Seoul National University, and this was an incredible experience.",
      "After my semester in South Korea, I had to spend my last semester writing my Master's thesis, and that's when I found an opportunity at the company King (makers of Candy Crush, and more) in Stockholm.",
      "Finishing my thesis at King was a lot of hard work, but in the end I got my degree after all, and left education behind me.",
      "In my professional life I have been working full-time as a Systems Developer at Retriever, in Stockholm, for little over a year.",
      "I am currently looking for the next big opportunity, to find equally passionate and compassionate people."
    ]
  }
}